#include <stdio.h>
int main()
{
    int i = 2;
    int j = 2;
    j += i++;                       //先赋值后加
    printf("i= %d, j= %d\n", i, j); // i= 3, j= 4
    i = 2;
    j = 2;
    j += ++i;                     //先加后赋值
    printf("i= %d, j= %d", i, j); // i= 3, j= 5
}

// 赋值顺序不同：++ i 是先加后赋值；i ++ 是先赋值后加；++i和i++都是分两步完成的。

// 效率不同：后置++执行速度比前置的慢。

// i++ 不能作为左值，而++i 可以：

void s1()
{
    int i = 0;
    int *p1 = &(++i); //正确
    // int* p2 = &(i++);//错误
    ++i = 1; //正确
    // i++ = 1;//错误
}

// 两者都不是原子操作。